# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SRFD, [128]] # 0-P2/4  H × W × C
  - [-1, 2, C3k2, [256, False, 0.25]] # H/2 × W/2 × 2C
  - [-1, 1, DRFD, [256]] # 2-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # H/4 × W/4 × 4C
  - [-1, 1, DRFD, [512]] # 4-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, DRFD, [1024]] # 6-P5/32  H/8 × W/8 × 8C
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 8
  - [-1, 2, C2PSA, [1024]] # 9
  - [-1, 1, AFGCAttention, []] # 10 H/8 × W/8 × 8C
# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [512, False]] # 16 (P3/8-small)

  - [-1, 1, DRFD, [512]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, DRFD, [512]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[3, 16], 1, PCAFFusion, [2]] # 23 (P3/8-small)
  - [[5, 19], 1, PCAFFusion, [4]] # 24 (P4/16-medium)
  - [[10, 22], 1, PCAFFusion, [8]] # 25 (P5/32-large)

  - [[23, 24, 25], 1, Detect, [nc]] # Detect(P3, P4, P5)
